{
    "projects" : [
        [
            {
                "id":1,
                "own_page":true,
                "is_github_link":true,
                "title":"This portfolio web app !",
                "date":"November-December 2020, personal project",
                "text":["It's been a while I wanted to create this website, in order to showcase the significant projects I've worked on. It is the first 'real' website I created, before I was only adapting some html files from famous websites to make buggy and ugly pages for associations or jokes.",
                "This is a pretty messy project where I learned to use React and tried to improve my javascript. When I started, I didn't know React, I barely understood Node, html and css and I had wrote only a few Javascript. Moreover I am pretty bad at design and UI. So I decided to start from a template found online (with thousands of mysterious lines of css) and tried to build something with React from there. I used Github pages to deploy the app because it is free and easy to use but I will probably change in the future because it does not really works with single page apps (don't try to reload the browser !).",
                "It was a lot of tinkering and it is still a bit buggy but I am pretty happy with the result and I think I learned a lot in a short period of time !"],
                "link":"https://github.com/MisterGado/portfolioWebApp",
                "im1":"./images/p1_i1.png",
                "im2":"./images/p1_i2.png",
                "imThumb":"./images/p1_i1.png"

            },
            {
                "id":2,
                "own_page":true,
                "is_github_link":true,
                "title":"Small rythm games in C++",
                "date":"March-April 2020, school project (optional)",
                "text":["Our C++ teacher proposed a short class for first year students where there was no class but only a project. The idea was to have us build something we had chosen from scratch in C++. We made (with a friend) 3 little rythm games using the user-friendly graphic library Imagine++.",
                "One of the game is a clone of Piano Tiles and in the two others, you have to stack some blocks in rythm. The result is not perfect and it really lacks sound effects but we were pretty happy of it knowing that we fully made it without any game engine."],
                "link":"https://github.com/MisterGado/RythmGames",
                "im1":"./images/p2_i1.png",
                "im2":"./images/p2_i2.png",
                "imThumb":"./images/p2_i2.png"
            },
            {
                "id":3,
                "own_page":true,
                "is_github_link":true,
                "title":"Serious game : Microgrid management",
                "date":"March-April 2020, school project",
                "text":["Alongside the class 'Optimisation and Energy' taught by researchers at EDF, I worked with four other students on a project. We were in charge of 4 classes during the semester where we had to organize a serious game for the 40 students. The main part of the project was the design and the implementation of this serious game.",
                "We had to create a serious game where 12 actors of 3 types (solar farms, factories and electric vehicles charging station) were interacting and tried to optimize the use of their batteries in order to minimize their costs. Each actor was played by a team of three students who had to wrote a Python script to execute their strategies on a given period of time. We had to create the actors, manage the costs and penalties calculation, give the players some relevant numbers and graphs to help them understand what they have to change etc...",
                " We also had to choose the underlying economic model. We played the role of the 'manager' of the microgrid whose objective was to reach an equilibrium and make our group of actors as independant as possible from the national energy supply. To achieve this goal we implemented different policies of penalties and reward to make the players interest converge to that equilibrium.",
                "This game was fully coded in Python and we used git to gather all the scripts from the player and run the game. It was a quite challenging project because we worked in a team of five and we had to make something understandable and fonctional for a whole class. It is the biggest Python code I've written and I learned a lot about object oriented programming thanks to it.",
                "The final version of the code is split into several repositories but we gathered most of the scripts in this repo."],
                "link":"https://github.com/MisterGado/PIR",
                "im1":"./images/p3_i1.jpg",
                "im2":"./images/p3_i2.png",
                "imThumb":"./images/p3_i1.jpg"

            }
        ],
        [
            {
                "id":4,
                "own_page":true,
                "is_github_link":true,
                "title":"Smart picture resizing",
                "date":"Fall 2019, school project",
                "text":["This was the first 'big' team project I worked on (a group of five students). We had to understand the method of seam carving and implement it and different applications.",
                "The idea of this technique is to remove (or duplicate) the paths which contain less discontinuity. The paths of minimal weights are found using dynamic programming and we chose some applications to use this method. First we implemented the reduction and enlargement of a picture and then we made a simple UI to allow users to chose some areas to delete or protect from modification, allowing really impressive results !",
                "We coded in plain C++ with the graphic library Imagine++. You can find more informations about the theory and the applications we chose in the pdf report (available on the Github repository)."],
                "link":"https://github.com/MisterGado/SeamCarving",
                "im1":"./images/p4_i1.png",
                "im2":"./images/p4_i2.png",
                "imThumb":"./images/p4_i2.png"

            },
            {
                "id":5,
                "own_page":true,
                "is_github_link":false,
                "title":"Prototyping NLP tools for a startup",
                "date":"Fall 2020 - Winter 2021",
                "text":["This project was offered to the school by the startup Harvestr. We volunteered for it with a friend alongside our class of Software Development.",
                "The objective was to create some prototypes of NLP (Natural Language Processing) tools for the startup. More precisely, this startup has developed an interface (sold to other companies) to gather all the clients' feedback and to rank the most relevant features that should be implemented. Currently, the links between the clients' messages and the features is done manually and they wanted us to try to add automation or at least a suggestion system.",
                "We couldn’t achieve all we wanted to try but we learned a lot : Typescript, Nodejs, AWS (Comprehend), Elasticsearch. But more importantly we learned what it’s like to code with professionals : good practices, tests, documentation, clarity etc..",
                "Nb : I can’t put the code here because it is there property."],
                "link":"",
                "im1":"./images/p5_i2.png",
                "im2":"./images/p5_i1.png",
                "imThumb":"./images/p5_i2.png"

            },
            {
                "id":6,
                "own_page":true,
                "is_github_link":true,
                "title":"FFT, Poisson's equation and image processing",
                "date":"February 2020, school project",
                "text":["During a course of algorithmics, we implemented the Fast Fourier Transform and numerically solved the Poisson equation. Then we did some interesting applications on image processing such as contrast enhancement (right picture) and smooth insertion of elements in another picture (left).",
                "This was coded in C++ using Imagine++ library. It is a project I liked a lot because it mixed programmation, advanced math and impressive results."],
                "link":"https://github.com/MisterGado/FFT_Poisson",
                "im1":"./images/p6_i1.png",
                "im2":"./images/p6_i2.png",
                "imThumb":"./images/p6_i1.png"

            }
        ],
        [
            {
                "id":7,
                "own_page":true,
                "is_github_link":true,
                "title":"Perfect error correction codes (Haming and Goley)",
                "date":"January-April 2019",
                "text":["I was working on my TIPE (a group project for the French engineering schools’ exams) at that time. We had chosen to work on error correction codes : coding the information to be able to reconstruct it even if it passed through noisy communication. It was very motivating because it had a lot of concrete applications and involved pretty tough maths (finite fields are a bit of a challenge).",
                "I decided to implement some of those correction codes in Python to test those methods. The code is far from clean - I had few, if any experience back then - but the results are still convincing. It was the first time I made a relevant project from scratch without instructions on which methods or library I should use.",
                "I put the full pdf report in the github repo if you are interested in the theory about these correction codes."],
                "link":"https://github.com/MisterGado/error_correction_codes",
                "im1":"./images/p7_i1.jpg",
                "im2":"./images/p7_i2.png",
                "imThumb":"./images/p7_i2.png"

            },
            {
                "id":8,
                "own_page":false,
                "is_github_link":false,
                "title":"3D reconstruction using stereo vision (currently working on it)",
                "date":"",
                "text":[],
                "link":"",
                "im1":"",
                "im2":"",
                "imThumb":"./images/wip.png"

            },
            {
                "id":9,
                "own_page":false,
                "is_github_link":false,
                "title":"Coming soon !",
                "date":"",
                "text":[],
                "link":"",
                "im1":"",
                "im2":"",
                "imThumb":"./images/wip.png"

            }
        ]
    ]
}